{"pageProps":{"allPosts":[{"title":"TIL: CLI tools for managing Github codeowners locally","date":"2025-05-29T00:00:00+02:00","slug":"til-cli-tools-for-managing-github-owners-locally","excerpt":"Two useful open source tools for validating CODEOWNER changes super quickly.","tags":["tools","github","open source"]},{"title":"TIL: Postgres can halt write activity","date":"2025-05-21T00:00:00+02:00","slug":"til-postgres-can-halt-write-activity","excerpt":"if it runs out of transaction identifiers.","tags":["postgres","databases"]},{"title":"5 Ways Working Remotely Made Me a Better Engineer","date":"2021-12-23T00:00:00.322Z","slug":"5-ways-working-remotely-made-me-a-better-engineer","excerpt":"I've been working 100% remotely since 2018. Here are 5 things that have contributed to my growth as an engineer.","tags":["remote work"]},{"title":"VOC Optimization - Module Caching (Google Summer of Code)","date":"2018-07-17T00:00:00.322Z","slug":"google-summer-code-part-2","excerpt":"Python code lives in Python modules (that is, a `.py` file). Thinking about the module as an object, it knows about all the constants, functions, and classes that are defined in the module itself. Every time one of those definitions is referenced, either for looking up or storing into, the module is used to resolve the definition...","tags":["python","performance optimization","open source"]},{"title":"VOC Optimization - Primitive Object Preallocation (Google Summer of Code)","date":"2018-06-19T00:30:00.322Z","slug":"google-summer-of-code-part-1","excerpt":"Everything in Python is an Object. This means that even small programs can create tons of Objects, including integers, booleans, and strings...","tags":["python","performance optimization","open source"]},{"title":"First Foray into Open Source","date":"2018-03-14T00:00:00.322Z","slug":"first-foray-into-open-source","excerpt":"or, How to Contribute to Open Source for the First Time...","tags":["open source"]},{"title":"Static Analysis and Abstract Interpretation","date":"2017-06-01T00:00:00.322Z","slug":"static-analysis-and-abstract-interpretation","excerpt":"Abstract interpretation has a reputation for being inaccessible. So I was very excited about two of the talks which promised gentle introductions to abstract interpretation, from Francesco Logozzo at Facebook and Matt Might at the University of Utah...","tags":["programming languages","program analysis","abstract interpretation"]},{"title":"Worry-free Concurrent Programming in Pony","date":"2017-05-30T00:00:00.322Z","slug":"pony","excerpt":"The Pony language, being developed at Sophia Drossopoulou’s group at Imperial College London, introduces two core ideas such that, if you can get your program to compile, guarantees memory safety (among other things).","tags":["pony","programming languages"]}]},"__N_SSG":true}