{"pageProps":{"post":{"title":"Static Analysis and Abstract Interpretation","date":"2017-06-01T00:00:00.322Z","tags":["programming languages","program analysis","abstract interpretation"],"slug":"static-analysis-and-abstract-interpretation","content":"<p>This is the second of three posts written about what I learned at the <a href=\"https://pliss2017.github.io/\">Programming Language Implementation Summer School</a>.</p>\n<p>Abstract interpretation has a reputation for being inaccessible. So I was very excited about two of the talks which promised gentle introductions to abstract interpretation, from <a href=\"https://www.linkedin.com/in/francesco-logozzo-4106386/\">Francesco Logozzo</a> at Facebook and <a href=\"http://matt.might.net/\">Matt Might</a> at the University of Utah (one of his last CS lectures too, before he takes officially the plunge into medicine!)</p>\n<h2>The engineering motivation</h2>\n<p>As programmers, we'd like to be able to write efficient code with as few bugs as possible. Unfortunately, the software engineering workflow doesn't really help us do this easily.</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/se-cartoon.jpg\" alt=\"Matt&#x27;s Slide\" title=\"Matt&#x27;s slide\"></p>\n<p>We try to write thorough tests, but the test suite grows with each bug fix. We rely on engineers with more experience to tell us about optimizations during code review, but if you don't have people with that kind of expertise on your team, then you're out of luck.</p>\n<p>That's why programming languages researchers have been working on static analysis techniques for forever, because static analysis can help catch bugs and find places ripe for optimization.</p>\n<h2>So what is static analysis?</h2>\n<p>Static analysis is about gathering information about a program without executing it.</p>\n<h2>And what is abstract interpretation?</h2>\n<p>Abstract interpretation is an approximation over all possible executions of a program.</p>\n<p>That sounds cryptic, but Francesco showed us an informal way to visualize it, and seeing the pictures really helped me. Let me try to replicate it:</p>\n<p>We want to find some way to express all the possible things that can happen during the program execution. So if we try to imagine what all possible executions of a program might look like, we could end up with something like this:</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/ai-trajectories.jpg\" alt=\"AI Trajectories\" title=\"AI Trajectories\"></p>\n<p>Disclaimer: This graph is from Patrick Cousot's <a href=\"http://www.di.ens.fr/~cousot/AI/IntroAbsInt.html\">Abstract Interpretation in a Nutshell</a>. The green and red coloring on subsequent images is my doing :-)</p>\n<p>Each colored line is a single execution, and the lot comprise the set of all possible executions (called the concrete semantics).</p>\n<p>Now if I color the execution space with this green color, then we can think of the entire green space as an abstraction of all the executions that lie within it (the abstract semantics).</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/ai-highlighted.jpg\" alt=\"AI Highlighted\" title=\"AI Highlighted\"></p>\n<p>We can add red areas to indicate something like an error zone:</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/ai-red.jpg\" alt=\"AI Red\" title=\"AI Red\"></p>\n<p>And now the cool part is that if we can say something about the green zone, then it applies to the program as well since all executions are bounded by the green. For example, if we can prove that the green zone never overlaps with the red zone, then we know that the program cannot produce those errors.</p>\n<h2>How do we use this?</h2>\n<p>We can actually perform abstract interpretation of a program via static analysis. That is, we can build a <em>partial</em> interpreter, and since it's not a real interpreter, when we use that on a program we're performing a static analysis. Matt showed us how to easily turn an interpreter into an abstract interpreter, which I will briefly outline here (but he has a whole <a href=\"http://matt.might.net/articles/intro-static-analysis/\">blog post</a> on this which is very good and easy to follow).</p>\n<p>Consider a simple case of sign analysis: we want to know whether the result of an arithmetic expression is positive, negative, or zero.</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/expr-rkt.jpg\" alt=\"Expr Racket\" title=\"Expr Racket\"></p>\n<p>Now the code for determining the value of the expression might look something like this:</p>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/eval-rkt.jpg\" alt=\"Eval Racket\" title=\"Eval Racket\"></p>\n<p>Warning: this is pseudocode.</p>\n<p>But if we just want to know the sign, we can tweak it a little bit by:</p>\n<ol>\n<li>Changing <em>eval</em> to <em>eval-sign</em></li></li>\n<li>Adding 3 helper functions <em>abstract</em>, <em>+/abstract</em> and *<em>/abstract</em> (omitted here for brevity)</li></li>\n<li>Wrapping the results inside <em>eval-sign</em> with our abstract helper functions</li></li>\n</ol>\n<p><img src=\"/assets/blog/static-analysis-and-abstract-interpretation/abstract-rkt.jpg\" alt=\"Abstract Racket\" title=\"Abstract Racket\"></p>\n<p>Disclaimer: this is Matt's code (I have made some simplications), as detailed on his blog.</p>\n<p>Notice that we have lost some information going from the original value <em>42</em> to <em>positive</em>. In other cases, we can get all of <em>negative</em>, <em>positive</em> and <em>zero</em> (sign is unknown).</p>\n<p>But we didn't have to <em>run</em> the program! In this toy example there really isn't a time savings because we execute even more lines of code, but it really isn't about creating a cheaper and less precise interpreter -- the information we get from the abstraction can help us make decisions about potential optimizations (maybe a value can never be negative, so we don't need to handle negative values), or catch bugs (perhaps we made an incorrect assumption that a value can't be zero).</p>\n<h2>Lingering questions</h2>\n<p>So, abstract interpretation is pretty awesome. As far as I can tell, the community is still actively working on abstract interpretation and static analysis techniques. However, I wonder if there are a few issues that make the most powerful static analyses not so usable:</p>\n<ol>\n<li>Do existing static analysis tools fit into the development process? One barrier to use is that good tool design, which includes meaningful explanations of defects, automatic fixes, and easy configurability is hard.</li>\n<li>Do you always have to know what information you want to abstract from the program? What if you don't know the \"shape\" of the concrete semantics and can't figure out what kind of analysis you want to do? Are there all-purpose static analyses?</li>\n<li>Isn't it expensive? Francesco mentioned that they could run a static analyzer on the entire Facebook codebase (tens of millions of LOC) in about 19 minutes. I would love to see more performance stats.</li>\n</ol>\n<p>References:</p>\n<p>B. Johnson, Y. Song and E. Murphy-Hill. \"Why Don't Software Developers Use Static Analysis Tools to Find Bugs?\" in <em>Proc. ICSE</em>, 2013, pp.672-681</p>\n"}},"__N_SSG":true}